import matplotlib.pyplot as plt
"""

10 0.000   0.000
15 384.358 0.000
20 379.132 0.000
25 370.619 0.000
30 367.027 0.000
35 358.099 0.000
40 342.956 0.000
45 316.703 0.000
50 237.967 0.008
55 28.976 0.093
60 10.207 0.169
65 4.009 0.233
70 0.886 0.288
75 0.187 0.336
80 0.020 0.377
85 0.000 0.414
90 0.000 0.447
95 0.000 0.476
100 0.000 0.503
plt.plot(list(range(101, 10, -5)), [0.000, 0.000, 0.000, 0.000, 0.020, 0.187, 0.886, 4.009, 10.207, 28.976, 237.967, 316.703, 342.956, 358.099,  367.027, 370.619,  379.132, 384.358, 387.368])
"""

plt.plot(list(range(101, 10, -5)), [387.368, 384.358, 379.132, 370.619, 367.027, 358.099, 342.956, 316.703, 237.967, 28.976, 10.207, 4.009, 0.886, 0.187, 0.020, 0.000, 0.000, 0.000, 0.000])
plt.xlabel("Інтенсивність")
plt.ylabel("Середній час очікування")
plt.title("Графік залежності середнього часу очікування від інтенсивності вхідного потоку")
plt.figure()

plt.plot(list(range(101, 10, -5)), [0.000, 0.000, 0.000 ,0.000 ,0.000 ,0.000 ,0.000, 0.000, 0.008, 0.093, 0.169, 0.233, 0.288, 0.336, 0.337, 0.414, 0.447, 0.476, 0.503])
plt.xlabel("Інтенсивність")
plt.ylabel("Процент простою")
plt.title("Графік залежності проценту простою від інтенсивності вхідного потоку")
plt.figure()


plt.plot(list(range(1, 33)), [5.244, 10.156, 9.29, 8.939, 9.667, 11.667, 7.65, 9.957, 10.25, 13.667, 16.265, 9.882, 15.882, 16.875, 10.212, 18.483, 23.417, 32.4, 32.944, 26.788, 37.821, 37.571, 43.897, 39.538, 66.5, 33.136, 87.481, 132.324, 200.538, 223.8, 449.515, 1700.077])
plt.xlabel("Пріоритет заявок")
plt.ylabel("Середній час очікування")
plt.title("Графік залежності середнього часу очікування від пріоритету заявок")

plt.show()
